/*ΑΣΚΗΣΗ 3
Να γράψετε πρόγραμμα που να διαβάζει για κάποιον άνθρωπο: 

α) το όνομά του, 
β) το ύψος του σε εκατοστά, και 
γ) το φύλο του («Α» για Άνδρα και «Γ» για Γυναίκα). 

Στη συνέχεια να εμφανίζει τον κατάλληλο χαρακτηρισμό σύμφωνα με τον παρακάτω πίνακα. 
Για παράδειγμα: «Ο Τάσος είναι ψηλός» ή «Η Μαρία είναι κανονική».
Για Άνδρες ύψος <170 "κοντός"
Για Γυναίκες ύψος <160 "κοντή"
170≤ ύψος <185 "κανονικός"
160≤ ύψος <175 "κανονική"
185≤ ύψος "ψηλός"
175≤ ύψος "ψηλή"

(Παρατήρηση: Θεωρήστε ότι το ύψος είναι θετικός αριθμός και το φύλο δηλώνεται πάντα σωστά).*/


#include<stdio.h>
int main (void)
{
    char name[31],sex[2];
    int ypsos;

    printf("Onoma: "); 
    scanf("%s", name); 

    printf("Ypsos: "); 
    scanf("%d", &ypsos); 

    printf("Fylo: "); 
    scanf("%s", sex);

    if (sex[0]=='a' || sex[0]=='A') 
        printf("O %s einai %s\n",name, (ypsos<170) ? "kontos": (ypsos<185) ? "kanonikos" : "psilos"); 

    else
        printf("H %s einai %s\n",name, (ypsos<160) ? "konti" : (ypsos<175) ? "kanoniki" : "psili");
    
}