/*ΑΣΚΗΣΗ 4
Μια εταιρεία κινητής τηλεφωνίας ακολουθεί ανά μήνα την πολιτική που φαίνεται στο παρακάτω πίνακα:
Πάγιο 10 Ευρώ

Χρόνος τηλεφωνημάτων (δευτερόλεπτα)

Χρονοχρέωση
(Ευρώ / δευτερόλεπτο)
1-500 0,004
501-800 0,003
801 και άνω 0,002

Διευκρίνηση: Η χρονοχρέωση θεωρείται κλιμακωτή. 
Δηλαδή τα πρώτα 500 δευτερόλεπτα χρεώνονται με 0,004 Ευρώ / δευτερόλεπτο, 
τα επόμενα 300 δευτερόλεπτα με 0,003 Ευρώ / δευτερόλεπτο και τα πέρα των 800 με 0,002 Ευρώ / δευτερόλεπτο.
Να γράψετε πρόγραμμα που: 
}
α) να διαβάζει τη χρονική διάρκεια των τηλεφωνημάτων ενός συνδρομητή σε διάστημα ενός μήνα.
β) να υπολογίζει τη μηνιαία χρέωση του συνδρομητή.
γ) να εμφανίζει (τυπώνει) τη λέξη "ΧΡΕΩΣΗ" και τη μηνιαία χρέωση του συνδρομητή.*/

#include <stdio.h>
int main(void)
{
    int d;
    float poso;

    printf("Diarkeia se secs: ");
    scanf("%d", &d);
    if (d <= 500)
        poso = d * 0.004;
    else if (d <= 800)
        poso = 500 * 0.004 + (d - 500) * 0.003;
    else
        poso = 500 * 0.004 + 300 * 0.003 + (d - 800) * 0.002;
    poso += 10;
    printf("XREOSI: %5.2f\n", poso);
}