/*ΑΣΚΗΣΗ 2
Να γράψετε πρόγραμμα που να διαβάζει έναν ακέραιο αριθμό
κ ο οποίος θα πρέπει να ελέγχεται ώστε να είναι 0≤κ≤9. 
Στη συνέχεια να εμφανίζει την προπαίδεια του αριθμού κ 
(π.χ. αν ο αριθμός είναι το 4 τότε να εμφανίζει 1x4=4, 2x4=8,... , 10x4=40).*/

#include <stdio.h>
int main(void)
{
    int i, k;
    do
    {
        printf("Dose enan arithmo (0<=k<=9): ");
        scanf("%d", &k);
    } while (k < 0 || k > 9);

    for (i = 1; i <= 10; i++)
        printf("%dx%d=%d\n", i, k, i * k);
}