/*Πρόγραμμα 23 
Το πρόγραμμα μετράει το πλήθος των χαρακτήρων που δίνονται από το
πληκτρολόγιο εξαιρώντας το σύμβολο της αλλαγής γραμμής ('\n'). 
Το τέλος εισαγωγής δεδομένων δηλώνεται με το σύμβολο ('*').*/

#include <stdio.h>
int main()
{
    int nc = 0, c;
    /* Η συνάρτηση getchar διαβάζει τον επόμενο
      χαρακτήρα της εισόδου και τον επιστρέφει σαν τιμή */
    c = getchar();
    
    while (c != '*')
    {
        if (c != '\n')
            nc = nc + 1;
        c = getchar();
    }
    printf("To plithos twn charaktirwn einai: %d\n", nc);
}
