#include <stdio.h>

//Μεταβλητες για ολες τις πυλες

int x, y, z, k, l, m, f;

int main()
{

    //Θα παρουμε απο τον χρηστη τις τιμες αλλα ταυτοχρονα
    //θα ελεγχουμε αν τα δινει σωστα (0 η 1) με do-while.

    do
    {
        printf("Δωσε τις τιμες για την εισοδο x : ");
        scanf("%d", &x);
    } while ((x != 0) && (x != 1));

    do
    {
        printf("Δωσε τις τιμες για την εισοδο y : ");
        scanf("%d", &y);
    } while ((y != 0) && (y != 1));

    do
    {
        printf("Δωσε τις τιμες για την εισοδο z : ");
        scanf("%d", &z);
    } while ((z != 0) && (z != 1));
    
    
    k = ((x) & (y));

   
    l = ((!x) & (!y));

    m = ((!y) & (z));
    f = ((x) & (y)) | ((!x) & (!y)) | ((!y) & (z)) ;

    printf("h eksodos einai f = %d \n", f);
}