#include <stdio.h>

//Μεταβλητες για ολες τις πυλες

int a, b, c, k, l, f;

int main()
{

    //Θα παρουμε απο τον χρηστη τις τιμες αλλα ταυτοχρονα
    //θα ελεγχουμε αν τα δινει σωστα (0 η 1) με do-while.

    do
    {
        printf("Δωσε τις τιμες για την εισοδο Α : ");
        scanf("%d", &a);
    } while ((a != 0) && (a != 1));

    do
    {
        printf("Δωσε τις τιμες για την εισοδο B : ");
        scanf("%d", &b);
    } while ((b != 0) && (b != 1));

    do
    {
        printf("Δωσε τις τιμες για την εισοδο C : ");
        scanf("%d", &c);
    } while ((c != 0) && (c != 1));
    //
    // Γενικη αποικωνιση A NAND B =
    // !(a && b)
    k = !((!a) && (!b));

    //
    // A NOR B
    // !(a || b)
    l = !((!b) || (!c));

    //
    // A XOR B =
    // (a && (!b)) || ((!a) && b)
    f = (k && (!l)) || ((!k) && l);

    printf("h eksodos einai f = %d \n", f);
}